# setup default applications dir
cask_args appdir: "/Applications"
# console tools
brew "git"
brew "wget"
brew "fish"
brew "mc" #midnight commander
brew "tig"
brew "mas" # need for install mas apps
brew "hugo" # blog engine
brew "highlight"
brew "python3"
brew "zlib"
brew "htop"
brew "openvpn"
brew "curl"
brew "gd"
brew "httpie"
brew "node"
brew "go" #go programming language
brew "dep" #dependencies tool for go
brew "elixir" #elixir programming language
brew "intltool"
# brew "homebrew/php/php71
# brew "homebrew/php/composer"
# brew "homebrew/php/php71-amqp"
# brew "homebrew/php/php71-memcached"
# brew "homebrew/php/php71-grpc"
# brew "homebrew/php/php71-intl"
# brew "homebrew/php/php71-mcryp"
# brew "homebrew/php/php71-xdebug"
cask "betterzip"
cask "google-chrome"
cask "docker"
cask "discord"
cask "iina"
cask "paw"
cask "iterm2"
cask "sequel-pro"
cask "cleanmymac"
cask "steam"
cask "adguard"
cask "league-of-legends"
cask "visual-studio-code"
cask "touchswitcher"
cask "skype"
cask "bartender"
cask "postico"
cask "phpstorm"
cask "fork"
###Quick look plugins
cask "betterzipql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-json"
cask "webpquicklook"
cask "qlimagesize"
cask "qlprettypatch"
cask "quicklook-csv"
cask "quicklookase"
### Mas Applications
mas "Affinity Photo", id: 824183456
mas "iThoughtsX", id: 720669838
mas "FSNotes", id: 1277179284
mas "GIF Brewery", id: 1081413713
mas "Kaleidoscope", id: 587512244
mas "GarageBand", id: 682658836
mas "Airmail", id: 918858936
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Pixelmator", id: 407963104
mas "Reeder", id: 880001334
mas "Medis", id: 1063631769
mas "SSH Copy", id: 823961613
mas "SSH Shell", id: 981765152
mas "ColorSnapper2", id: 981765152
mas "KeyKey", id: 1035137927
mas "Monosnap", id: 540348655
mas "goPanel", id: 1099728373
mas "LilyView", id: 529490330
mas "Tyme2", id: 1063996724
mas "Tenor", id: 1043270657
mas "Weather Indicator", id: 1181817945
mas "SnippetsLab", id: 1006087419
mas "Pocket", id: 568494494
mas "Twitter", id: 409789998
mas "Unsplash Wallpapers", id: 1284863847
mas "Cloud Mail.Ru", id: 893068358
mas "Pages", id: 409201541
mas "Duplicate Photos Fixer Pro", id: 963642514
mas "Slack", id: 803453959
mas "OhMyStar2", id: 1218642292
mas "DaisyDisk", id: 411643860
mas "Gestimer", id: 990588172
mas "iMovie", id: 408981434
mas "Numbers", id: 409203825
mas "Paste", id: 967805235
mas "Markoff", id: 1084713122
mas "Keynote", id: 409183694
mas "iA Writer", id: 775737590
mas "1Password", id: 443987910
mas "The Clock", id: 488764545